Podkova/src/AccumulationRegisters/ПрочиеАктивыПассивы/ПрочиеАктивыПассивы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПрочиеАктивыПассивы</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>РасчетСебестоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИсточника</name>
    <type>
      <types>EnumRef.ВидыИсточниковДвижений</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>EnumRef.ИсточникиУправленческогоБаланса</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИсточникДвижений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статья</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика</name>
    <type>
      <types>Characteristic.СтатьиАктивовПассивов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Podkova/src/Enums/ИсточникиУправленческогоБаланса/ИсточникиУправленческогоБаланса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИсточникиУправленческогоБаланса</name>
  <enumValues>
    <name>АмортизацияНМА</name>
  </enumValues>
  <enumValues>
    <name>АмортизацияОС</name>
  </enumValues>
  <enumValues>
    <name>ДенежныеДокументы</name>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредстваБезналичные</name>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредстваВКассахККМ</name>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредстваВПути</name>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредстваНаличные</name>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредстваУПодотчетныхЛиц</name>
  </enumValues>
  <enumValues>
    <name>ПартииПрочихРасходов</name>
  </enumValues>
  <enumValues>
    <name>ПереданнаяВозвратнаяТара</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныеСертификаты</name>
  </enumValues>
  <enumValues>
    <name>ПринятаяВозвратнаяТара</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеАктивыПассивы</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходы</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасходы</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоФинансовымИнструментам</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКлиентами</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКлиентамиПоДокументам</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСПоставщиками</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКлиентамиПоСрокам</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСПоставщикамиПоДокументам</name>
  </enumValues>
  <enumValues>
    <name>СебестоимостьТоваров</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСПоставщикамиПоСрокам</name>
  </enumValues>
  <enumValues>
    <name>РезервыПоСомнительнымДолгам</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьНМА</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьОС</name>
  </enumValues>
  <enumValues>
    <name>ТоварыКОформлениюОтчетовКомитенту</name>
  </enumValues>
  <enumValues>
    <name>ТрудозатратыНезавершенногоПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасходыНезавершенногоПроизводства</name>
  </enumValues>
  <enumValues>
    <name>УслугиКОформлениюОтчетовПринципалу</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/AccumulationRegisters/ПрочиеАктивыПассивы/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка
	 ИЛИ РасчетСебестоимостиПрикладныеАлгоритмы.ДвиженияЗаписываютсяРасчетомПартийИСебестоимости(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Т.НомерСтроки
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ПрочиеАктивыПассивы КАК Т
	|ГДЕ
	|	Т.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И Т.ВидИсточника = ЗНАЧЕНИЕ(Перечисление.ИсточникиУправленческогоБаланса.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ.НомерСтроки
	|ИЗ
	|	ВТ КАК ВТ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ.НомерСтроки");
	
	Запрос.УстановитьПараметр("ПрочиеАктивыПассивы", ЭтотОбъект.Выгрузить());
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Шаблон = НСтр("ru = 'Запись не верна! Значение поля ""Организация"" не может быть пустым! (Регистр накопления: Активы и пассивы; Номер строки: %1)'");
		ВызватьИсключение СтрШаблон(Шаблон, Выборка.НомерСтроки);
	КонецЕсли;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.СохранитьДвиженияСформированныеРасчетомПартийИСебестоимости(ЭтотОбъект, Замещение);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
